dtpay-sprint-tenant-v1.0 codespace.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="dTPay Test Case">
      <stringProp name="TestPlan.comments">This is a test case for dTPay</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments">
          <elementProp name="TEST_PLAN_TITLE" elementType="Argument">
            <stringProp name="Argument.name">TEST_PLAN_TITLE</stringProp>
            <stringProp name="Argument.value">dTPay Test Case</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DT_URL" elementType="Argument">
            <stringProp name="Argument.name">DT_URL</stringProp>
            <stringProp name="Argument.value">${__P(p_dt_url)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="DT_TOKEN" elementType="Argument">
            <stringProp name="Argument.name">DT_TOKEN</stringProp>
            <stringProp name="Argument.value">${__P(p_dt_token)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Main - Scenario 1 - dtpay">
        <stringProp name="ThreadGroup.num_threads">${__P(p_threads, 10)}</stringProp>
        <intProp name="ThreadGroup.ramp_time">5</intProp>
        <stringProp name="ThreadGroup.duration">${__P(p_duration, 60)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">${__P(p_loops, -1)}</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
          <collectionProp name="HeaderManager.headers">
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">User-Agent</stringProp>
              <stringProp name="Header.value">ApacheJMeter/5.x (Custom-Testing)</stringProp>
            </elementProp>
            <elementProp name="" elementType="Header">
              <stringProp name="Header.name">Content-Type</stringProp>
              <stringProp name="Header.value">application/json</stringProp>
            </elementProp>
          </collectionProp>
        </HeaderManager>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Home Page">
          <stringProp name="HTTPSampler.domain">dtpay.34.67.92.11.nip.io</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Payment Request Page">
          <stringProp name="HTTPSampler.domain">dtpay.34.67.92.11.nip.io</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/api/payment</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;amount&quot;: ${randomPrice},&#xd;
    &quot;method&quot;: &quot;${paymentType}&quot;,&#xd;
    &quot;fullName&quot;: &quot;${randomFullName}&quot;,&#xd;
    &quot;userId&quot;: ${randomUserId}&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <JSR223PreProcessor guiclass="TestBeanGUI" testclass="JSR223PreProcessor" testname="JSR223 PreProcessor" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.Random

Random rand = new Random()

// 1. Generate Random Price (e.g., between 10.00 and 1000.00)
double minPrice = 10.00
double maxPrice = 1000.00
double randomPrice = minPrice + (maxPrice - minPrice) * rand.nextDouble()
vars.put(&quot;randomPrice&quot;, String.format(&quot;%.2f&quot;, randomPrice))

// 2. Select Random Payment Method from Array
def methods = [&quot;CreditCard&quot;, &quot;DebitCard&quot;, &quot;PayPal&quot;]
def randomMethod = methods[rand.nextInt(methods.size())]
vars.put(&quot;paymentType&quot;, randomMethod)

// 3. Generate Random Full Name (Using simple lists to mimic Postman)
def firstNames = [&quot;James&quot;, &quot;Mary&quot;, &quot;Robert&quot;, &quot;Patricia&quot;, &quot;John&quot;, &quot;Jennifer&quot;, &quot;Michael&quot;, &quot;Linda&quot;, &quot;David&quot;, &quot;Elizabeth&quot;]
def lastNames = [&quot;Smith&quot;, &quot;Johnson&quot;, &quot;Williams&quot;, &quot;Brown&quot;, &quot;Jones&quot;, &quot;Garcia&quot;, &quot;Miller&quot;, &quot;Davis&quot;, &quot;Rodriguez&quot;, &quot;Martinez&quot;]
def randomFullName = firstNames[rand.nextInt(firstNames.size())] + &quot; &quot; + lastNames[rand.nextInt(lastNames.size())]
vars.put(&quot;randomFullName&quot;, randomFullName)

// 4. Generate Random User ID (e.g., 5-digit number)
int randomUserId = rand.nextInt(90000) + 10000 
vars.put(&quot;randomUserId&quot;, randomUserId.toString())</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223PreProcessor>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>